In [1]:
import pandas as pd
import pyodbc

In [3]:
server = r'DESKTOP-5KQL2U6\MSSQLSERVER01'
database = 'Python'
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                           f'SERVER={server};'
                           f'DATABASE={database};'
                           'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()

##### LENDO A TABELA DO SSMS

In [4]:
Categoria = pd.read_sql('select * from [dbo].[Categoria]', conexaoDB)

Categoria

C:\Users\henry\AppData\Local\Temp\ipykernel_9528\3471958724.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Categoria = pd.read_sql('select * from [dbo].[Categoria]', conexaoDB)

        Item  Preco
0      miojo    625
1   macarrão    594
2     feijão    650
3    chinelo    862
4         PC    432
5         TV    139
6   Lanterna    175
7      lápis    293
8    relógio    529
9      mouse    507
10     Carro    705

#### FAZENDO COM VARIAVEL

In [5]:
Query = 'select * from [dbo].[Categoria]'

Categoria2 = pd.read_sql(Query, conexaoDB)

Categoria2

C:\Users\henry\AppData\Local\Temp\ipykernel_9528\3004519793.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Categoria2 = pd.read_sql(Query, conexaoDB)

        Item  Preco
0      miojo    625
1   macarrão    594
2     feijão    650
3    chinelo    862
4         PC    432
5         TV    139
6   Lanterna    175
7      lápis    293
8    relógio    529
9      mouse    507
10     Carro    705

#### Selecionando apenas algumas linhas usando condições

In [10]:
Query = '''

select * from [dbo].[Itens]
where Começo in(1, 2, 3)

'''

In [11]:
Itens = pd.read_sql(Query, conexaoDB)

Itens

C:\Users\henry\AppData\Local\Temp\ipykernel_9528\3184063696.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Itens = pd.read_sql(Query, conexaoDB)

   Começo  Meio  Fim
0       1    11   21
1       2    12   22
2       3    13   23